app/controllers/pokemon_controller.rb

	def capture
		@pokemon = Pokemon.find(params[:id])
		@pokemon.trainer_id = current_trainer.id
		@pokemon.save
---
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "pokemons" SET "trainer_id" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["trainer_id", 5], ["updated_at", "2016-03-17 20:06:29.796813"], ["id", 4]]

	def damage
		@pokemon = Pokemon.find(params[:id])
		@pokemon.health = @pokemon.health - 10

		if @pokemon.health <= 0
			@pokemon.destroy
		else
			@pokemon.save
---
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "pokemons" SET "health" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["health", 90], ["updated_at", "2016-03-18 02:53:51.233232"], ["id", 1]]