app/views/trainers/show.html.erb


<% @trainer.pokemon.each do |p| %>
---
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."trainer_id" = ?  [["trainer_id", 5]]